Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.s3-home-ipd will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3-home-ipd"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:GetObjectVersion",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::246850902828:user/github-actions",
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_s3_bucket.s3-home must be replaced
-/+ resource "aws_s3_bucket" "s3-home" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::terraform-20220123171338585400000002" -> (known after apply)
      ~ bucket                      = "terraform-20220123171338585400000002" -> (known after apply)
      ~ bucket_domain_name          = "terraform-20220123171338585400000002.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = "foodtrucks" # forces replacement
      ~ bucket_regional_domain_name = "terraform-20220123171338585400000002.s3.us-east-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2O1EMRO9K5GLX" -> (known after apply)
      ~ id                          = "terraform-20220123171338585400000002" -> (known after apply)
      ~ region                      = "us-east-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ website_domain              = "s3-website.us-east-2.amazonaws.com" -> (known after apply)
      ~ website_endpoint            = "terraform-20220123171338585400000002.s3-website.us-east-2.amazonaws.com" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }

      ~ website {
            # (2 unchanged attributes hidden)
        }
    }

  # aws_s3_bucket_policy.public-read will be created
+ resource "aws_s3_bucket_policy" "public-read" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # github_actions_secret.S3_BUCKET will be created
+ resource "github_actions_secret" "S3_BUCKET" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "foodtrucks"
      + secret_name     = "S3_BUCKET"
      + updated_at      = (known after apply)
    }

Plan: 3 to add, 0 to change, 1 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.greenatlantis.ga/lock?id=marknooch%252Ffoodtrucks%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>
Plan: 3 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
